# 3. Вывести на экран числа от -N до N

for x in range(-8, 9):
    print(x)